# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12-P2 object detection model with P2/4 - P5/32 outputs
# Adds a stride-4 (P2/4) detection head on top of the official YOLO12 backbone+head
# for small / dim targets in maritime aerial imagery (3 classes: 落水人员 / 船只 / 浮标).
# Base backbone & module set taken verbatim from official cfg/models/12/yolo12.yaml.
# P2 head-extension pattern follows official cfg/models/v8/yolov8-p2.yaml.
# Model docs: https://docs.ultralytics.com/models/yolo12
# ⚠️ 在 4070S 上首训前请确认 ultralytics>=8.3.0 能解析本结构；train.py 解析失败会响亮回退。

# Parameters
nc: 3 # number of classes: 落水人员(person-in-water) / 船只(vessel) / 浮标(buoy)
scales: # model compound scaling constants, i.e. 'model=yolo12s-p2.yaml' loads this with scale 's'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12 backbone (unchanged from official yolo12.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  (P2/4 feature source)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  (P3/8 feature source)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6  (P4/16 feature source)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8  (P5/32 feature source)

# YOLO12-P2 head (FPN top-down extended to P2/4, then PAN bottom-up P2->P3->P4->P5)
head:
  # --- FPN top-down: P5 -> P4 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10  cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11  (FPN-P4)

  # --- FPN top-down: P4 -> P3 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13  cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14  (FPN-P3)

  # --- FPN top-down: P3 -> P2 (NEW small-object branch) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 2], 1, Concat, [1]] # 16  cat backbone P2
  - [-1, 2, A2C2f, [128, False, -1]] # 17  (P2/4-xsmall) --> Detect

  # --- PAN bottom-up: P2 -> P3 ---
  - [-1, 1, Conv, [128, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19  cat head P3 (FPN-P3)
  - [-1, 2, A2C2f, [256, False, -1]] # 20  (P3/8-small) --> Detect

  # --- PAN bottom-up: P3 -> P4 ---
  - [-1, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 11], 1, Concat, [1]] # 22  cat head P4 (FPN-P4)
  - [-1, 2, A2C2f, [512, False, -1]] # 23  (P4/16-medium) --> Detect

  # --- PAN bottom-up: P4 -> P5 ---
  - [-1, 1, Conv, [512, 3, 2]] # 24
  - [[-1, 8], 1, Concat, [1]] # 25  cat backbone P5
  - [-1, 2, C3k2, [1024, True]] # 26  (P5/32-large) --> Detect

  - [[17, 20, 23, 26], 1, Detect, [nc]] # 27  Detect(P2/4, P3/8, P4/16, P5/32)
